dominiczy/satelliteplatform/processors/msp430at/actsim_pipe/msp430_pipe_ID.cpp
    isa.behavior_bic_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 48: // bic_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bic_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 49: // bic_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bic_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 50: // bis_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bis_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 51: // bis_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bis_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 52: // bis_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bis_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 53: // bis_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bis_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 54: // bis_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bis_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 55: // bit_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bit_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 56: // bit_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bit_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 57: // bit_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bit_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 58: // bit_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bit_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 59: // bit_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_bit_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 60: // cmp_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_cmp_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 61: // cmp_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_cmp_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 62: // cmp_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_cmp_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 63: // cmp_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_cmp_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 64: // cmp_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_cmp_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 65: // dadd_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_dadd_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 66: // dadd_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_dadd_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 67: // dadd_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_dadd_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 68: // dadd_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_dadd_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 69: // dadd_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_dadd_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 70: // sub_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sub_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 71: // sub_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sub_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 72: // sub_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sub_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 73: // sub_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sub_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 74: // sub_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_sub_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 75: // subc_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_subc_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 76: // subc_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_subc_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 77: // subc_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_subc_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 78: // subc_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_subc_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 79: // subc_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_subc_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 80: // xor_32idst
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_xor_32idst(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 81: // xor_32isrc
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_xor_32isrc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 82: // xor_32imm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_xor_32imm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 83: // xor_32iaim
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_xor_32iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 84: // xor_32irm
    isa._behavior_msp430_Double_32(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    isa.behavior_xor_32irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(1), instr_vec->get(9), instr_vec->get(10), instr_vec->get(11), instr_vec->get(12), instr_vec->get(13), instr_vec->get(14));
    break;
   case 85: // mov_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_mov_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 86: // mov_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_mov_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 87: // mov_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_mov_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 88: // add_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_add_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 89: // add_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_add_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 90: // add_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_add_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 91: // addc_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_addc_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 92: // addc_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_addc_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 93: // addc_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_addc_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 94: // and_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_and_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 95: // and_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_and_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 96: // and_16iaim
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_and_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 97: // bic_16rm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bic_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 98: // bic_16irm
    isa._behavior_msp430_Double(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_bic_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(15), instr_vec->get(16), instr_vec->get(17), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 99: // bic_16iaim
