dominiczy/satelliteplatform/processors/msp430at/actsim_pipe/msp430_pipe_ID.cpp
    isa.behavior_sxt_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 155: // sxt_16irm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_sxt_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 156: // sxt_16iaim
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_sxt_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 157: // push_16rm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_push_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 158: // push_16irm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_push_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 159: // push_16iaim
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_push_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 160: // call_16rm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_call_16rm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 161: // call_16irm
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_call_16irm(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 162: // call_16iaim
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_call_16iaim(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 163: // reti
    isa._behavior_msp430_Single(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    isa.behavior_reti(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(23), instr_vec->get(24), instr_vec->get(18), instr_vec->get(19), instr_vec->get(20));
    break;
   case 164: // jne
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jne(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
   case 165: // jeq
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jeq(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
   case 166: // jnc
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jnc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
   case 167: // jc
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jc(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
   case 168: // jn
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jn(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
   case 169: // jge
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jge(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
   case 170: // jl
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jl(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
   case 171: // jmp
    isa._behavior_msp430_Jump(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    isa.behavior_jmp(static_cast<msp430_parms::ac_stage_list>(id), 0, instr_vec->get(25), instr_vec->get(26), instr_vec->get(27));
    break;
  }
 }
 regout->write(*instr_vec);
 delete instr_vec;
 done.notify();
 return;
}
